Name :- Nikhil Gopale

Student ID :- 44712

Roll No :- 30

Class :- Msc-Data Science And Big Data Analytics.

## Pandas Exercise

## Part 1

In [2]:
import pandas as pd
import numpy as np

#### 1. Given a list with numbers 1,2,3,4,5,6. Output the corresponding pandas  series

In [2]:
a= [1,2,3,4,5,6]
a=pd.Series(a)
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

#### 2. Given a list with numbers 1,2,3,4,5,6. Output the corresponding pandas  series with odd indexes only

In [3]:
a= [1,2,3,4,5,6]
a= pd.Series((a),index=[0,3,6,9,11,13])
a

0     1
3     2
6     3
9     4
11    5
13    6
dtype: int64

#### 3. Generate the series of dates from 1st Jan, 2022 to 12th Jan, 2022 (both inclusive)

In [4]:
d = pd.date_range('1/1/2022' ,periods=12)
d

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

#### 4. Apply the function, f(x) = x divide by 2 on each and every element of a given pandas series 2,5,6,7,8,9

In [5]:
a= pd.Series([2,5,6,7,8,9])
s=a.apply(lambda x:x/2)
s

0    1.0
1    2.5
2    3.0
3    3.5
4    4.0
5    4.5
dtype: float64

#### 5. In the given series, filter words that contain atleast 2 vowels from a series? ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [6]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
vo = ser[ser.str.count('(?i)[aeiou]') >=2]
vo

0     Apple
1    Orange
4     Money
dtype: object

#### 6. Given a dictionary having three keys name, age, subjectMarks and dept with 6 values each, convert it into corresponding dataframe and display it

In [7]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
dic

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
3   Ketan   20     64
4   Rahul   19     74
5      JJ   23     34

#### 7. Given a dataframe, change the index of a dataframe from the default indexes to a particular column

In [8]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
index1=['a','b','c','d','e','f']
df = pd.DataFrame(dic, index = index1)

df

  Name  Age  Marks
a  NaN  NaN    NaN
b  NaN  NaN    NaN
c  NaN  NaN    NaN
d  NaN  NaN    NaN
e  NaN  NaN    NaN
f  NaN  NaN    NaN

#### 8. Given a dataframe, sort it by age and studentMarks columns

In [9]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
sv= dic.sort_values(by=['Age','Marks'])
sv

     Name  Age  Marks
4   Rahul   19     74
3   Ketan   20     64
2  Ganesh   21     56
1  Sanket   22     90
5      JJ   23     34
0  Nikhil   23     80

#### 9. Given a dataframe with custom indexing, convert it to default indexing and display it

In [10]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
index1=['a','b','c','d','e','f']
df = pd.DataFrame(dic, index = index1)

df.reset_index()

  index Name  Age  Marks
0     a  NaN  NaN    NaN
1     b  NaN  NaN    NaN
2     c  NaN  NaN    NaN
3     d  NaN  NaN    NaN
4     e  NaN  NaN    NaN
5     f  NaN  NaN    NaN

#### 10.Given a dataframe, select the name column and display it using both loc and iloc method

In [11]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
print(dic)
print ("------------loc-------------")
loc = dic.loc[dic["Name"]=='Nikhil']
print(loc)
print ("------------iloc -------------")
iloc = dic.iloc[:4]
print(iloc)

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
3   Ketan   20     64
4   Rahul   19     74
5      JJ   23     34
------------loc-------------
     Name  Age  Marks
0  Nikhil   23     80
------------iloc -------------
     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
3   Ketan   20     64

#### 11. Given a dataframe, select first 2 rows and output them using both loc and iloc method

In [12]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,23],
                   "Marks":[80,90,56,64,74,34]})
iloc = dic.iloc[:2]
iloc

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90

#### 12.Given a dataframe, select all the rows whose age is greater than 20

In [13]:
dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,18],
                   "Marks":[80,90,56,64,74,34]})
loc = dic.loc[dic["Age"]>20]
print(loc)
print ("-------------------------")
sim = dic[dic["Age"]>20]
print(sim)

     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56
-------------------------
     Name  Age  Marks
0  Nikhil   23     80
1  Sanket   22     90
2  Ganesh   21     56

#### 13.Given a dataframe displaying the average marks of students wrt each department

In [14]:
# groupby Function

dic = pd.DataFrame({"Name":['Nikhil','Sanket','Ganesh','Ketan','Rahul','JJ'],
                   "Age":[23,22,21,20,19,18],
                   "Marks":[80,90,56,64,74,34],
                   "Dept":["Analytics","DS","ML","AI","Egn","Maths"]})
group = dic.groupby("Dept")["Marks"].mean()
group

Dept
AI           64.0
Analytics    80.0
DS           90.0
Egn          74.0
ML           56.0
Maths        34.0
Name: Marks, dtype: float64

#### 14.Given a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

In [15]:
df = pd.DataFrame({"cname":["Tata","Jio","Zomato","Swiggy","Mahindra","Amazone","Google"],
                           "profit":[5,3,4,-1,-8,6,-3]})
print(df)    


df['map_functions'] = df["profit"].apply(lambda x:x>0)
df['map_functions']

      cname  profit
0      Tata       5
1       Jio       3
2    Zomato       4
3    Swiggy      -1
4  Mahindra      -8
5   Amazone       6
6    Google      -3

0     True
1     True
2     True
3    False
4    False
5     True
6    False
Name: map_functions, dtype: bool

#### 15.Write a Pandas program to accept the data in random format. Compute the minimum, 25th percentile, median, 75th, and maximum of a given series.

In [16]:
import numpy as np
sate  = np.random.RandomState(50)
ran = pd.Series(sate.normal(10,100,4))
result = np.percentile(ran, q=[0, 25, 50, 75, 100])
print("\nMinimum, 25th percentile, median, 75th,  maximum ")
print(result)


# Convert into DF
index1=['Minimum', '25th percentile', 'median', '75th',  'maximum'] 
pd.DataFrame(result,index=index1)

Minimum, 25th percentile, median, 75th,  maximum
[-146.03521087 -138.85233911  -94.27544545  -37.34407188    6.90223965]

                          0
Minimum         -146.035211
25th percentile -138.852339
median           -94.275445
75th             -37.344072
maximum            6.902240

#### 16.Write a Pandas program convert the first and last character of each word to upper case in each word of a given series as follows.Series (['php', 'python', 'java', 'c#'])

In [17]:
pro = pd.Series(['php', 'python', 'java', 'c#'])
print("Original Series:")
print(pro)
result = pro.map(lambda x: x[0].upper() + x[1:-1] + x[-1].upper())
print("\nFirst and last character of each word to upper case:")
print(result)

Original Series:
0       php
1    python
2      java
3        c#
dtype: object

First and last character of each word to upper case:
0       PhP
1    PythoN
2      JavA
3        C#
dtype: object

# Part 2

#### 1. Create a new Series object, passing in the flavors list defined below flavors = ["Spicy Sweet Chili", "Cool Ranch", "Nacho Cheese", "Salsa Verde"]

In [18]:
flavors = pd.Series(["Spicy Sweet Chili", "Cool Ranch", "Nacho Cheese", "Salsa Verde"])
flavors

0    Spicy Sweet Chili
1           Cool Ranch
2         Nacho Cheese
3          Salsa Verde
dtype: object

#### 2. Assign it to a 'doritos' variable. The resulting Series should look like this:

In [19]:
doritos = pd.Series(flavors)
doritos

0    Spicy Sweet Chili
1           Cool Ranch
2         Nacho Cheese
3          Salsa Verde
dtype: object

#### 3. Sort the doritos Series in descending order. Make sure the operation is permanent.

In [20]:
doritos.sort_values(ascending = False  , inplace=True)
doritos

0    Spicy Sweet Chili
3          Salsa Verde
2         Nacho Cheese
1           Cool Ranch
dtype: object

#### 4. Sort the doritos Series index in descending order. Make sure the operation is permanent.

In [21]:
doritos.sort_index(ascending = False  , inplace=True)
doritos

3          Salsa Verde
2         Nacho Cheese
1           Cool Ranch
0    Spicy Sweet Chili
dtype: object

#### 5. Consider the given below guitar dictionary guitars_dict = { "Fender Telecaster": "Baby Blue", "Gibson Les Paul":"Sunburst", "ESP Eclipse": "Dark Green"}  Assign the resulting Series to a "guitars" variable.

In [22]:
guitars_dict =  { "Fender Telecaster": "Baby Blue",
"Gibson Les Paul":"Sunburst", "ESP Eclipse": "Dark Green"}

# Convert into Series 
guitar=pd.Series(guitars_dict)
guitar

Fender Telecaster     Baby Blue
Gibson Les Paul        Sunburst
ESP Eclipse          Dark Green
dtype: object

#### 6. Access the value for the index position of 0 within the "guitars" Series.Assign the value to a "fender_color" variable.

In [23]:
fender_color = guitar[0]
fender_color

'Baby Blue'

#### 7. Access the value for the index label of "Gibson Les Paul" in the "guitars" Series. Assign the value to a "gibson_color" variable.

In [24]:
gibson_color= guitar['Gibson Les Paul']
gibson_color

'Sunburst'

#### 8 .Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes

In [25]:
# Import CSV File 

house = pd.read_csv(r"C:\Users\USER\Desktop\Datasets\BostonHousing.csv")
house.head() # First 5 Rows

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [26]:
# Binning the medv column  [ Low - High]

house['medv_binned'] = house['medv'].mask(house['medv']<25, 'Low').mask(house['medv']>25, 'High')
house

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv,medv_binned
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4,Low
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6,Low
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9,Low
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0,Low
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9,Low

In [27]:
# For Drop any Column  

# house.drop(columns=['binned'],inplace=True)

#### 9.Get the number of rows, columns, datatype and summary statistics of each column of BostonHousing dataset. Also get the numpy array and list equivalent of the dataframe

In [28]:
# Count Number of Columns & Rows
shape = house.shape
print(shape)

(506, 15)

In [29]:
# Check DataType
dtype = house.dtypes
print(dtype)

crim           float64
zn             float64
indus          float64
chas             int64
nox            float64
rm             float64
age            float64
dis            float64
rad              int64
tax              int64
ptratio        float64
b              float64
lstat          float64
medv           float64
medv_binned     object
dtype: object

In [30]:
# summary statistics of each column

des = house.describe()
des

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,3.613524,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,8.601545,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,3.677083,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

In [31]:
# Information about Data
des = house.info()
des

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   crim         506 non-null    float64
 1   zn           506 non-null    float64
 2   indus        506 non-null    float64
 3   chas         506 non-null    int64
 4   nox          506 non-null    float64
 5   rm           506 non-null    float64
 6   age          506 non-null    float64
 7   dis          506 non-null    float64
 8   rad          506 non-null    int64
 9   tax          506 non-null    int64
 10  ptratio      506 non-null    float64
 11  b            506 non-null    float64
 12  lstat        506 non-null    float64
 13  medv         506 non-null    float64
 14  medv_binned  506 non-null    object
dtypes: float64(11), int64(3), object(1)
memory usage: 59.4+ KB

In [32]:
# Drop Any Column..

#house.drop(columns=['binned'],inplace=True

In [33]:
house.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv,medv_binned
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2,High

#### 10 .Which manufacturer, model and type has the highest Price? What is the row and column number of the cell with the highest Price value?

In [34]:
model =  pd.read_csv(r"C:\Users\USER\Desktop\Datasets\model.csv")
model.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [35]:
# Find  model and type has the highest Price
model.loc[model.Price == np.max(model.Price), ['Manufacturer', 'Model', 'Type']]

     Manufacturer Model     Type
58  Mercedes-Benz  300E  Midsize

In [36]:
 #find row and column number of the cell with the highest Price value
row, col = np.where(model.values == np.max(model.Price))    
model.iloc[row[0], col[0]]

61.9

#### 11. Rename the column Type as HouseType in df and replace the ‘.’ in column names with ‘_’. Input

In [37]:
model=model.rename(columns = {'Type':'HouseType'})
model.columns = model.columns.map(lambda x: x.replace('.', '_'))
model.columns

Index(['Manufacturer', 'Model', 'HouseType', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

#### 12 .Check whether there are any NULL values in the given dataset.

In [38]:
model.isnull().values.any()

True

#### 13. Count the number of missing values in each column of df. Which column has the maximum number of missing values?

In [39]:
model.isnull().sum()

Manufacturer           4
Model                  1
HouseType              3
Min_Price              7
Price                  2
Max_Price              5
MPG_city               9
MPG_highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev_per_mile           6
Man_trans_avail        5
Fuel_tank_capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn_circle            5
Rear_seat_room         4
Luggage_room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

#### 14. Replace missing values in Min.Price and Max.Price columns with their respective mean

In [42]:
model['Min_Price'].fillna(int(model['Min_Price'].mean()),inplace=True)
model['Max_Price'].fillna(int(model['Max_Price'].mean()),inplace=True)

model.head()

,Manufacturer,Model,HouseType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.0,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.0,30.0,21.0,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [43]:
model.isnull().sum()

Manufacturer           4
Model                  1
HouseType              3
Min_Price              0
Price                  2
Max_Price              0
MPG_city               9
MPG_highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev_per_mile           6
Man_trans_avail        5
Fuel_tank_capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn_circle            5
Rear_seat_room         4
Luggage_room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64